# Languages
brew "go"
brew "golang"
brew "node"
cask "java"

# IDEs
cask "phpstorm"
cask "intellij-idea"
cask "goland"
cask "webstorm"

# Tooling
brew "terraform"
cask "sequel-pro"
cask "postico"
brew "gpg"
cask "gpg-suite"
brew "dep"
tap "go-swagger/go-swagger"
brew "go-swagger"
cask "postman"

# Productivity
cask "slack"
cask "google-chrome"
cask "1password"
cask "iterm2"
cask "atom"

# Containers
cask "docker"
brew "kubectl"
brew "docker-compose"

# Fun
cask "spotify"
cask "ableton-live-standard"
cask "whatsapp"

# Compilation
brew "autoconf"
brew "automake"
brew "libtool"
brew "shtool"
brew "gflags"
