# Languages
brew "go"
brew "golang"
brew "node"
brew "python"

# IDEs
cask "goland"
cask "webstorm"

# Tooling
brew "terraform"
cask "postman"
cask "google-cloud-sdk"
brew "wget"
brew "pre-commit"
brew "skaffold"
cask "ngrok"
brew "jq"
brew "helm"
brew "awscli"
cask "graphiql"

# Productivity
cask "slack"
cask "google-chrome"
cask "1password"
cask "iterm2"
brew "zsh"
brew "zsh-completions"

# Containers
cask "docker"
brew "kubectl"

# Fun
cask "spotify"
cask "whatsapp"

