# Languages
brew "go"
brew "golang"
brew "node"
cask "java"
cask "homebrew/cask-versions/java8"
brew "python"
brew "flow"

# IDEs
cask "phpstorm"
cask "intellij-idea"
cask "goland"
cask "webstorm"

# Tooling
brew "terraform"
cask "sequel-pro"
cask "postico"
brew "gpg"
cask "gpg-suite"
brew "dep"
tap "go-swagger/go-swagger"
brew "go-swagger"
cask "postman"
cask "google-cloud-sdk"
brew "hugo"
brew "wget"
brew "vault"
brew "gitlab-runner"
brew "kubernetes-helm"
brew "watch"
brew "git-crypt"
brew "pre-commit"
cask "ngrok"

# Productivity
cask "slack"
cask "google-chrome"
cask "1password"
cask "iterm2"
cask "atom"
brew "zsh"
brew "zsh-completions"

# Containers
cask "docker"
brew "kubectl"
brew "docker-compose"

# Fun
cask "spotify"
cask "ableton-live-standard"
cask "whatsapp"

# Compilation
brew "autoconf"
brew "automake"
brew "libtool"
brew "shtool"
brew "gflags"

# Design
cask "zeplin"
cask "sketch"
